<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [25]:
import pandas as pd
import psycopg2

In [26]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [27]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [28]:
# текст запроса
query_3_1 = f'''select count(*)
                from public.vacancies
             '''

In [29]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''select count(*)
                from public.employers
             '''

In [7]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = f'''select count(*)
                from public.areas
             '''

In [9]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''select count(*)
                from public.industries
             '''

In [11]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

Посмотрев на цифры, можно назвать выборку вакансий обширной и достаточной для учебного анализа.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [12]:
# текст запроса
query_4_1 = f'''select count(*) cnt, a.name area
                from public.vacancies v
                join public.areas a on v.area_id=a.id
                group by a.name
                order by 1 desc
                limit 5
            '''

In [13]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [14]:
# текст запроса
query_4_2 = f'''select count(*) cnt
                from public.vacancies v
                where v.salary_from is not null or v.salary_to is not null
            '''

In [15]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [16]:
# текст запроса
query_4_3 = f'''select round(avg(v.salary_from)), round(avg(v.salary_to))
                from public.vacancies v
                '''

In [17]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [18]:
# текст запроса
query_4_4 = f'''select schedule,
                       employment,
                       count(*)
                from public.vacancies
                group by 1,2
                order by 3 desc
                '''

In [19]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [20]:
# текст запроса
query_4_5 = f'''select experience,
                       count(*)
                from public.vacancies
                group by 1
                order by 2
                '''

In [21]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

Видим, что вакансий из Москвы гораздо больше, чем вакансий из других городов. 
Также, мы нашли усредненную зарплатную вилку, увидели что только в половине вакансий вообще указана зарплата. 
Видим, что подавляющее большинство вакансий требуют полную занятость и полный раб. день или удаленную работу. 

Также, большинство работодателей ищут специалистов с небольшим опытом работы (от 1 до 6 лет). Это можно объяснить тем, что работодатели не хотят тратить своё время и средства на обучение неопытного человека. Сильно опытные же специалисты уже просят другие деньги и занимают другие должности.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [22]:
# текст запроса
query_5_1 = f'''select e.name, count(*)
                from public.vacancies v
                join public.employers e on e.id=v.employer_id
                group by 1
                order by 2 desc
                limit 5'''

In [23]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [24]:
# текст запроса
query_5_2 = f'''select a.name area, count(distinct e.id) employers, count(distinct v.id) vacancies
                from public.areas a
                left join public.vacancies v on a.id=v.area_id
                left join public.employers e on e.area=a.id
                group by 1
                order by 2 desc'''
                
query_5_2_1 = f'''select a.name area, count(distinct e.id) employers, count(distinct v.id) vacancies
                from public.areas a
                left join public.vacancies v on a.id=v.area_id
                join public.employers e on e.area=a.id
                where v.id is null
                group by 1
                order by 2 desc
                limit 1'''

In [83]:
# результат запроса: все регионы
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_2408\812816054.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

In [30]:
# результат запроса: регион с наибольшим количеством работодателей, без вакансий
df = pd.read_sql_query(query_5_2_1, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\1813374118.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2_1, connection)

     area  employers  vacancies
0  Россия        410          0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [31]:
# текст запроса
query_5_3 = f'''select e.name, count(distinct v.area_id) 
                from public.vacancies v
                right join public.employers e on e.id=v.employer_id
                group by 1
                order by 2 desc'''

In [32]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
23170                  СДЕЛКА      0
23171            Alandr Group      0
23172                     СДК      0
23173      Lemon Land Lombard      0
23174                  Махина      0

[23175 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [33]:
# текст запроса
query_5_4 = f'''select count(*)
                from public.employers e
                left join public.employers_industries i on e.id=i.employer_id
                where i.industry_id is null'''

In [34]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [35]:
# текст запроса
query_5_5 = f'''select e.name
                from public.employers e
                join public.employers_industries i on e.id=i.employer_id
                group by e.id
                having count(*)=4
                order by 1
                offset 2
                limit 1'''

In [36]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [37]:
# текст запроса
query_5_6 = f'''select count(distinct e.employer_id)
                from public.employers_industries e
                join public.industries i on e.industry_id=i.id
                where i.name = 'Разработка программного обеспечения'
                group by e.industry_id'''

In [38]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [39]:
# код для доступа к странице на wiki
import requests # Импортируем библиотеку requests
from bs4 import BeautifulSoup # Импортируем библиотеку BeautifulSoup
url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России' # Задаём адрес ресурса
response = requests.get(url) # Делаем GET-запрос к ресурсу
page = BeautifulSoup(response.text, 'lxml') # Создаём объект BeautifulSoup

In [40]:
# код для получения списка городов-милионников
rows = page.select('#mw-content-text > div > table:nth-child(27) > tbody > tr') # Идентифицируем таблицу
cities = []
for i in range(len(rows)):
    if i in [2,3] or i in range(5, 19): # Выбираем только подходящие номера строк
        name = rows[i].select('td')[1].select('a')[0].text # "Достаем" название города
        cities.append(name) # Формируем список
        
tup_cities = tuple(cities) # Преобразуем в кортеж
print(tup_cities)

('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')

In [41]:
# текст запроса
query_5_7 = f'''select a.name, count(v.id)
                from public.vacancies v
                join public.employers e on e.id=v.employer_id
                join public.areas a on a.id=v.area_id
                where e.name = 'Яндекс' and a.name in {tup_cities}
                group by 1

                union all

                select 'Total', count(*)
                from public.vacancies v
                join public.employers e on e.id=v.employer_id
                join public.areas a on a.id=v.area_id
                where e.name = 'Яндекс' and a.name in {tup_cities}
                order by 2'''

In [42]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            Total    485

***

Если сравнить количество работодателей, у кого не указана сфера деятельности, и количество работодателей, указавших в сферу "Разработка ПО", можно обратить внимание, что цифра больше всего в 2 раза, а не в десятки, что, скорее всего, подтверждает всеобщее умозаключение о том, что программисты - одни из самых востребованных специалистов на рынке труда на сегодняшний день.

Рекордсмены по количеству вакансий - Яндекс и Ростелеком, являются также лидерами и в списке по количеству охватываемых регионов. 

Проанализировав результаты исследования вакансий "Яндекса", можно сделать предположение, что эта компания ищет IT-специалистов и программистов по всей России, в том числе и с возможностью удаленной работы, так как вакансии очень равномерно распределены по городам-милионникам, а кроме того, и по остальным регионам. Можно развить это предположение, узнав, какой процент всех вакансий Яндекса предлагает удаленную работу.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [43]:
# текст запроса
query_6_1 = f'''select count(*)
                from public.vacancies
                where lower(name) like '%data%' or lower(name) like '%данн%'
                '''

In [44]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [45]:
# текст запроса
query_6_2 = f'''select count(*)
                from public.vacancies
                where 
                    (lower(name) like '%data scientist%' or
                    lower(name) like '%data science%' or 
                    lower(name) like '%исследователь данных%' or
                    lower(name) like '%ml%' or
                    lower(name) like '%machine learning%' or
                    lower(name) like '%машинн%обучен%') and
                    (lower(name) like '%junior%' or
                    lower(experience) like '%нет опыта%' or 
                    lower(employment) like '%стажировка%') and
                    lower(name) not like '%html%'
                    '''

In [46]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [47]:
# текст запроса
query_6_3 = f'''select count(*)
                from public.vacancies
                where 
                    (lower(name) like '%data scientist%' or
                    lower(name) like '%data science%' or 
                    lower(name) like '%исследователь данных%' or
                    name like '%ML%' or
                    lower(name) like '%machine learning%' or
                    lower(name) like '%машинн%обучен%') and
                    name not like '%HTML%' and
                    (key_skills like '%SQL%' or
                    key_skills like '%postgres%')'''

In [48]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [49]:
# текст запроса
query_6_4 = f'''select count(*)
                from public.vacancies
                where 
                    (lower(name) like '%data scientist%' or
                    lower(name) like '%data science%' or 
                    lower(name) like '%исследователь данных%' or
                    name like '%ML%' or
                    lower(name) like '%machine learning%' or
                    lower(name) like '%машинн%обучен%') and
                    name not like '%HTML%' and
                    key_skills like '%Python%'
                    '''

In [50]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [51]:
# текст запроса
query_6_5 = f'''select round(avg(length(key_skills) + 1 - length(replace(key_skills,CHR(9),''))), 2) 
                from public.vacancies
                where 
                    (lower(name) like '%data scientist%' or
                    lower(name) like '%data science%' or 
                    lower(name) like '%исследователь данных%' or
                    name like '%ML%' or
                    lower(name) like '%machine learning%' or
                    lower(name) like '%машинн%обучен%') and
                    name not like '%HTML%' and
                    key_skills is not null'''

In [52]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [53]:
# текст запроса
query_6_6 = f'''select experience, round(avg((coalesce(salary_to, salary_from)+coalesce(salary_from,salary_to))/2)) average_salary
                from public.vacancies
                where 
                    (lower(name) like '%data scientist%' or
                    lower(name) like '%data science%' or 
                    lower(name) like '%исследователь данных%' or
                    name like '%ML%' or
                    lower(name) like '%machine learning%' or
                    lower(name) like '%машинн%обучен%') and
                    name not like '%HTML%' and
                    key_skills is not null and
                    (salary_from is not null or
                    salary_to is not null)
                group by 1'''

In [54]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience  average_salary
0           Нет опыта         74643.0
1  От 1 года до 3 лет        146704.0
2       От 3 до 6 лет        243115.0

***

Изучив вакансии, связанные с данными, мы видим, что среди очень большого количества вакансий, есть достаточно много предложений для начинающих специалистов (без опыта). При этом, в требованиях к таким специалистам с примерно одинаковой частотой фигурируют знания языков программирования Python и SQL/Postgres, из чего мы можем сделать вывод, что оба эти языка важны при обучении на DS-специалиста.

Также мы увидели средние показатели предлагаемой ЗП для соискателей с разным опытом работы, где с каждой трехлеткой она увеличивается почти в 2 раза, что характеризует выбранную нами специальность, как финансово благоприятную для развития :)

# Общий вывод по проекту

Изучив базу вакансий сайта hh.ru можно сделать наметки на дальнейшее исследование компании Яндекс, как лидера и по количеству регионов, и по количеству вакансий. Так как нас, в первую очередь, интересуют вакансии для DS-специалистов, можно двигаться в исследовании вакансий Яндекса в этой сфере: зарплаты, регионы, сравнение с другими мега-холдингами по различным критериям. 

Также, интересно будет сравнить в целом вакансии из разных регионов: зарплатная вилка, график, какаие ключевые навыки наиболее востребованы.

В результате исследования стало понятно, что DS-специалисты - наиболее востребованные и высокооплачиваемые специалисты на рынке труда.

In [55]:
# дополнительное исследование: посмотрим, какие навыки требуются у DS-специалистов чаще всего
query_x = f'''select key_skills, count(*)
              from public.vacancies
              where 
                  (lower(name) like '%data scientist%' or
                  lower(name) like '%data science%' or 
                  lower(name) like '%исследователь данных%' or
                  name like '%ML%' or
                  lower(name) like '%machine learning%' or
                  lower(name) like '%машинн%обучен%') and
                  name not like '%HTML%' and
                  key_skills is not null 
              group by 1
              order by 2 desc'''

In [66]:
# результат запроса
df = pd.read_sql_query(query_x, connection)
df

C:\Users\Анна\AppData\Local\Temp\ipykernel_12204\1157039653.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_x, connection)

                                            key_skills  count
0    Python\tMachine Learning\tData Analysis\tNumpy...     14
1    Оценка рисков\tMS PowerPoint\tСтатистический а...     13
2    Qt\tООП\tC++\tMS Visual Studio\tРазработка ком...      9
3    Python\tmachine learning\tweb security\tsklear...      9
4    Git\tООП\tAtlassian Jira\tJava\tAtlassian Conf...      7
..                                                 ...    ...
313  Python\tComputer Vision\tTensorflow\tPyTorch\t...      1
314  Python\tC++\tSQL\tАвтоматизация технологически...      1
315  Python\tC++\tНаписание статей\tНаписание научн...      1
316  Python\tC++\tНаписание статей\tНаписание научн...      1
317  Python\tC++\tОптимизация кода\tАнализ кода\tМа...      1

[318 rows x 2 columns]

In [75]:
skills = [] # вспомогательный список
df4 = df.assign(skills_list = 1) # вспомогательный столбец

In [86]:
skills = {} # создаем словарь для подсчета навыков
for i in range(len(df4)):
    df4['skills_list'].iloc[i] = df4['key_skills'].iloc[i].split('\t') # записываем в новый столбец список навыков при помощи метода Split
    for skill in df4['skills_list'].iloc[i]: # заполняем словарь
        if skill not in skills:
            skills[skill] = df4['count'].iloc[i]
        else:
            skills[skill] += df4['count'].iloc[i]

sorted_skills = dict(sorted(skills.items(), key=lambda skill: skill[1], reverse=True))
print(pd.Series(sorted_skills).head(20))

Python                          348
SQL                             191
Machine Learning                114
Git                              66
Математическая статистика        62
Data Analysis                    54
Pandas                           52
Data Science                     52
ML                               49
Английский язык                  48
Linux                            47
Анализ данных                    46
PyTorch                          46
Big Data                         42
Математическое моделирование     41
Статистический анализ            40
NLP                              40
C++                              39
Spark                            38
Tensorflow                       35
dtype: int64

В таблице выше видно, какие навыки запрашиваются чаще всего у DS-специалистов. Python лидирует, но и стальные лидеры рейтинга нам хорошо знакомы, так как в нашей учебной программе все эти термины открыты для изучения.

Код выше можно использовать для детального анализа других специальностей.